clear;clc;close all;

Q_all = 1;%剖面剪力
Torque = 1;%剖面扭矩
G = 1;%剪切模量

%杆件x位置
rod_x = [0; 1; 2; 3; 4; 5; 6];
%蒙皮单元厚度
t_b = [3; 2; 1; 1; 2; 3];
%杆件高度
rod_h = [0.5; 0.75; 1; 1; 1; 0.75; 0.5];
%杆件面积
rod_A = [1; 2; 2; 3; 2; 2; 1];
%腹板位置对应的rod编号
web_loc = [1;3;5;7];
%腹板厚度
t_w = [2;1;1;2];




% %一个有表达式的例子
% aa=1;
% bb=2;
% t1=1;
% t2=2;
% t3=3;
% t4=4;
% h=0.2;

% L=aa+bb;
% xs = 2*L* (bb/L * 1/(2*t4/t3*bb/h+t4/t2) - aa/L * 1/(2*aa/h+1))/...
%     (t1/t4 + 1/(2*t4/t3*bb/h+t4/t2) + 1/(2*aa/h+1));
% xs = xs+aa
% 
% %杆件x位置
% rod_x = [0; aa; aa+bb];
% %蒙皮单元厚度
% t_b = [t4; t3];
% %杆件高度
% rod_h = [h;h;h];
% %杆件面积
% rod_A = [0;2;0];
% %腹板位置对应的杆件编号
% web_loc = [1;2;3];
% %腹板厚度
% t_w = [t4;t1;t2];

